#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/SECONDARY_SOURCE"]: Refreshing state... [id=29e820c6-284b-4209-ae0a-430c5033fd30/dcc3f917-a5aa-46f1-a7f7-3e9ed6e0e5ad]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/PRIMARY_SOURCE"]: Refreshing state... [id=74af1232-8e9f-44e5-be27-0863f000291a/4b919d71-c76b-4621-be50-f05a7e8ed144]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/PRIMARY_SOURCE"]: Refreshing state... [id=74af1232-8e9f-44e5-be27-0863f000291a/9ce4e013-c2b7-4379-a46e-1c6b495803a6]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/PRIMARY_SOURCE"]: Refreshing state... [id=74af1232-8e9f-44e5-be27-0863f000291a/7430c88e-e4e4-4bbd-b262-d4c9bc3ba564]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/PRIMARY_SOURCE"]: Refreshing state... [id=74af1232-8e9f-44e5-be27-0863f000291a/96650edd-ac15-4f9c-a27b-2be7231344bf]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/PRIMARY_SOURCE"]: Refreshing state... [id=74af1232-8e9f-44e5-be27-0863f000291a/895c4a65-e67d-4657-bba3-df5a1440fc58]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_FLVR/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/ab63ae34-0fda-4f1b-ac8f-1380bea87f44/24124d3b-7a3e-4a8b-af90-47c03394b350]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_CONF/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/c0fe2e9f-6937-4ffa-9296-d786d9b0a98b/dcc3f917-a5aa-46f1-a7f7-3e9ed6e0e5ad]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_SIT/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/1197df69-9199-49a5-a49a-c7d43d35551c/9c02e9eb-e774-4a31-8e43-3e54a54ea88f]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_STG/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/2e161683-3c4d-4a2a-a86b-c83f2fe3e3d7/f692dc45-2411-41f7-ac95-da948714f1a7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_UAT/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/045f3224-9637-4785-a661-fc6f028804d2/7da1617b-2d92-4c2c-8981-dd7151a76a85]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/4e6fc50d-7fe8-4538-ac58-7871aea011b8]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/5438b8e8-4948-4446-a083-531ec9654913]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/PRIMARY_SOURCE"]: Refreshing state... [id=moh_applications/client/1bb19ec0-20f1-4c82-b38e-56f437ad9c45/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/895c4a65-e67d-4657-bba3-df5a1440fc58]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/PRIMARY_SOURCE"]: Refreshing state... [id=moh_applications/client/1bb19ec0-20f1-4c82-b38e-56f437ad9c45/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/4b919d71-c76b-4621-be50-f05a7e8ed144]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/CONSUMER"]: Refreshing state... [id=moh_applications/client/1bb19ec0-20f1-4c82-b38e-56f437ad9c45/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/1251650d-4190-4cda-a00b-011cf1cbffc7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/CONSUMER"]: Refreshing state... [id=moh_applications/client/1bb19ec0-20f1-4c82-b38e-56f437ad9c45/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/d3dc70e8-af0e-4cb9-9e79-3706c94fd8da]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/PRIMARY_SOURCE"]: Refreshing state... [id=520d0511-7764-4ec6-8dea-ae861cd9e8a6/895c4a65-e67d-4657-bba3-df5a1440fc58]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/CONSUMER"]: Refreshing state... [id=520d0511-7764-4ec6-8dea-ae861cd9e8a6/1251650d-4190-4cda-a00b-011cf1cbffc7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/CONSUMER"]: Refreshing state... [id=520d0511-7764-4ec6-8dea-ae861cd9e8a6/d3dc70e8-af0e-4cb9-9e79-3706c94fd8da]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-WAVA.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/PRIMARY_SOURCE"]: Refreshing state... [id=520d0511-7764-4ec6-8dea-ae861cd9e8a6/4b919d71-c76b-4621-be50-f05a7e8ed144]
module.KEYCLOAK_PROD.module.moh_applications.module.MANAGE-USERS.keycloak_role.REALM_ROLE: Refreshing state... [id=eeac5c0a-7b1b-4607-ad95-1630769b5892]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-MID-TIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/4e3d322a-fbe7-438d-8ee7-95a1707d40dc]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-DBA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/9ada1d3b-be63-40a3-84f2-e4ec0e10be88]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/27967216-03f7-4259-b50a-955b995d51ad]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/1798203d-027f-4856-a445-8a90c1dc9756]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-MIDTIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/782fe94e-79a2-438f-9bc1-28717395b28d]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/658f081c-a8b0-4c1b-b9ee-7e8901158ce7]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/ba2aead8-cd2d-4519-991b-3bd44c71c057]
module.KEYCLOAK_PROD.module.moh_applications.module.DMFT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PIDP-SERVICE/view_endorsement_data"]: Refreshing state... [id=68a46e0b-2861-4850-8cb3-dfae13e47ca3/0c2d08b1-b900-4b0c-a4d3-9e6e3e1ef847]
module.KEYCLOAK_PROD.module.moh_applications.module.DMFT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/view_endorsement_data"]: Refreshing state... [id=moh_applications/client/c87f3feb-3c06-4d61-a5c2-48c593cccd1b/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/0c2d08b1-b900-4b0c-a4d3-9e6e3e1ef847]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/7489c26e-77c8-47ad-9c07-a9bb97a37d91]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/65d6f8b7-0703-46ed-9ced-55457bd6c14b]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/86ec4f91-45fb-4e65-ae4f-e1b952fd4e47]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/60dfb3b9-5ceb-4498-a24c-9641796bd991/43bf4fca-777a-4c9c-9127-f9677c654fef]
module.KEYCLOAK_PROD.module.moh_applications.module.CGI-MID-TIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/303c6348-22b8-4351-abdf-da5b48689724]
module.KEYCLOAK_PROD.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/e8976c36-6816-4b71-8c2f-3053a8168de7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_PROD.module.moh_applications.module.HCIM_MOH_CRS.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "HCIM_MOH_CRS"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Healthcare Client Identity Management"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HCIM_MOH_CRS.keycloak_openid_hardcoded_claim_protocol_mapper.hcim_org will be created
  + resource "keycloak_openid_hardcoded_claim_protocol_mapper" "hcim_org" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + add_to_userinfo     = true
      + claim_name          = "hcim_org"
      + claim_value         = "organization/MOH_CRS"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "hcim_org"
      + realm_id            = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HCIM_MOH_CRS.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*